# DOCS https://docs.brew.sh/Brew-Bundle-and-Brewfile
#───────────────────────────────────────────────────────────────────────────────

brew "openjpeg"
brew "webp"
brew "pinentry"
brew "tree-sitter"
brew "leptonica"
brew "certifi"
brew "ca-certificates"
brew "openssl@3"
brew "gnupg"
brew "tesseract"

brew "bat"
brew "eza"
brew "fzf"
brew "gh"
brew "git-delta"
brew "just"
brew "less"
brew "mas"
brew "neovim"
brew "node"
brew "pandoc"
brew "pass"
brew "pinentry-mac"
brew "ripgrep"
brew "spotify_player"
brew "starship"
brew "yq"
brew "yt-dlp"
brew "zsh-autocomplete"
brew "zsh-autopair"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

tap "felixkratz/formulae"
brew "felixkratz/formulae/sketchybar"

cask "alfred"
cask "alt-tab"
cask "appcleaner"
cask "brave-browser"
cask "cleanshot"
cask "espanso"
cask "font-jetbrains-mono-nerd-font"
cask "hammerspoon"
cask "karabiner-elements"
cask "microsoft-word"
cask "mimestream"
cask "neovide"
cask "obsidian"
cask "replacicon"
cask "slack"
cask "wezterm"
cask "zoom"

cask "steam"
cask "transmission"
cask "bettertouchtool"
cask "iina"
cask "anki"
cask "catch"

#───────────────────────────────────────────────────────────────────────────────

mas "Folder Preview", id: 6698876601
mas "Highlights", id: 1498912833
mas "Ivory", id: 6444602274
mas "Peek", id: 1554235898
