tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "romkatv/powerlevel10k"
brew "bat"
brew "blueutil"
brew "python@3.9"
brew "exa"
brew "fd"
brew "unbound"
brew "gnutls"
brew "tesseract"
brew "ffmpeg"
brew "flake8"
brew "fortune"
brew "fzf"
brew "node"
brew "iconsur"
brew "mas"
brew "nghttp2"
brew "pandoc"
brew "ripgrep"
brew "shellcheck"
brew "starship"
brew "tesseract-lang"
brew "yamllint"
brew "youtube-dl"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
cask "alacritty"
cask "alfred"
cask "appcleaner"
cask "brave-browser"
cask "busycal"
cask "discord"
cask "espanso"
cask "flameshot"
cask "hammerspoon"
cask "istat-menus"
cask "karabiner-elements"
cask "macpass"
cask "marta"
cask "mimestream"
cask "obsidian"
cask "rocket"
cask "shottr"
cask "slack"
cask "steam"
cask "sublime-text"
cask "subtitles"
cask "transmission"
cask "vlc"
mas "Drafts", id: 1435957248
mas "Peek", id: 1554235898
mas "Twitterrific", id: 1289378661
