tap "hisbaan/tap"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "mgmeyers/pdfannots2json"
brew "bat"
brew "python@3.9"
brew "exa"
brew "fd"
brew "tesseract"
brew "fileicon"
brew "flake8"
brew "fortune"
brew "fzf"
brew "node"
brew "iconsur"
brew "markdownlint-cli"
brew "mas"
brew "ocrmypdf"
brew "pandoc"
brew "php"
brew "pylint"
brew "shellcheck"
brew "six"
brew "starship"
brew "subliminal"
brew "tesseract-lang"
brew "yamllint"
brew "youtube-dl"
brew "yq"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "hisbaan/tap/didyoumean"
brew "mgmeyers/pdfannots2json/pdfannots2json"
cask "alacritty"
cask "alfred"
cask "appcleaner"
cask "bettertouchtool"
cask "brave-browser"
cask "busycal"
cask "catch"
cask "cryptomator"
cask "discord"
cask "espanso"
cask "flameshot"
cask "grammarly-desktop"
cask "hammerspoon"
cask "iina"
cask "istat-menus"
cask "karabiner-elements"
cask "macpass"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-word"
cask "mimestream"
cask "moneymoney"
cask "obsidian"
cask "portfolioperformance"
cask "slack"
cask "steam"
cask "sublime-text"
cask "subtitles"
cask "terminology"
cask "transmission"
cask "zoom"
mas "Color Picker", id: 1545870783
mas "Drafts", id: 1435957248
mas "Gifski", id: 1351639930
mas "Highlights", id: 1498912833
mas "Peek", id: 1554235898
mas "Pixelmator Pro", id: 1289583905
mas "Twitterrific", id: 1289378661
